
n = int(input("请给出需要打印的层数"))

N = 4*n + 5 # 这个层数与一般理解的不一样，哪怕一层实际上是按照这个规律产生的九层输出。每多一层加4层的输出范围。

c = "." # 空白的地方用这个填补

print(c*2 + '$' * (N-4) + c*2) # 先输出前两行，一定是这个规律
print(c*2 + '$' + (4*n-1)*c + '$' + c*2)

for i in range(n):
    print( "$."*(i) + "$$$."+ (4*(n-i)-3)*'$' + ".$$$" + ".$"*(i))
    if i!=n-1:
        print("$."*(i) + "$...$"+(4*(n-i)-5)*"."+ "$...$"+ ".$"*(i))
    else:
        print("$."*(i) + "$..."+"$" + "...$" + ".$"*(i) )

print("$."*n + 5*"$" + ".$"*n)

for i in range(n-1, -1, -1):
    if i!=n-1:
        print("$."*(i) + "$...$"+(4*(n-i)-5)*"."+ "$...$"+ ".$"*(i))
    else:
        print("$."*(i) + "$..."+"$" + "...$" + ".$"*(i) )

    print( "$."*(i) + "$$$."+ (4*(n-i)-3)*'$' + ".$$$" + ".$"*(i))

print(c*2 + '$' + (4*n-1)*c + '$' + c*2) # 最后两层一定是这个规律，收尾
print(c*2 + '$' * (N-4) + c*2)